In [1]:
# Eda  - Titanic dataset
#contd..--Ipl
#read_csv,head/tail
#info , describe
#isnull,groupby
#max,apply,concat
#idxmax

In [2]:
import pandas as pd

In [7]:
df=pd.read_csv('C:\\Users\\rkmai\\Downloads\\ml-100k\\u.data',sep='\t',header=None,names=['user id','item id',' rating',' timestamp'])

In [8]:
df.head(4)

   user id  item id   rating   timestamp
0      196      242        3   881250949
1      186      302        3   891717742
2       22      377        1   878887116
3      244       51        2   880606923

In [9]:
df['item id'].nunique()

1682

In [10]:
df['user id'].nunique()

943

In [11]:
df=pd.read_csv('C:\\Users\\rkmai\\Downloads\\ml-100k\\u.data',sep='\t',header=None)

In [12]:
df.head()

     0    1  2          3
0  196  242  3  881250949
1  186  302  3  891717742
2   22  377  1  878887116
3  244   51  2  880606923
4  166  346  1  886397596

In [13]:
df.columns=['user id','item id',' rating',' timestamp']

In [14]:
df.head()

   user id  item id   rating   timestamp
0      196      242        3   881250949
1      186      302        3   891717742
2       22      377        1   878887116
3      244       51        2   880606923
4      166      346        1   886397596